Revit 2027 API
ParameterTypeId.BendingDetailTypeSegmentLengthDimensionsEnabled Property
 "Segment Length Dimensions"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId BendingDetailTypeSegmentLengthDimensionsEnabled { get; }
Public Shared ReadOnly Property BendingDetailTypeSegmentLengthDimensionsEnabled As ForgeTypeId
	Get
public:
static property ForgeTypeId^ BendingDetailTypeSegmentLengthDimensionsEnabled {
	ForgeTypeId^ get ();
}
static member BendingDetailTypeSegmentLengthDimensionsEnabled : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace